app/controllers/incidentes_controller.rb

  def index

    # Título de la página
    @titulo = "Inicio"

    # Lógica de busqueda
    @q = Incidente.ransack(params[:q])

    @incidentes = @q.result(distinct: true).page params[:page]
---
SELECT COUNT(*) AS count_all, tipo AS tipo FROM "incidentes" GROUP BY tipo
SELECT DISTINCT COUNT(DISTINCT "incidentes"."id") AS count_id, tipo AS tipo FROM "incidentes" GROUP BY tipo  ORDER BY "incidentes"."id" DESC

  def create
    @incidente = Incidente.new(incidente_params)

    respond_to do |format|
      if @incidente.save
---
INSERT INTO "incidentes" ("asunto", "descripcion", "responsable", "tipo", "prioridad", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["asunto", "a"], ["descripcion", "b"], ["responsable", "c"], ["tipo", "s"], ["prioridad", 2], ["created_at", "2015-01-09 03:03:24.769181"], ["updated_at", "2015-01-09 03:03:24.769181"]]

  def update
    respond_to do |format|
      if @incidente.update(incidente_params)
---
UPDATE "incidentes" SET "asunto" = ?, "descripcion" = ?, "responsable" = ?, "tipo" = ?, "prioridad" = ?, "updated_at" = ? WHERE "incidentes"."id" = ?  [["asunto", "Sistema"], ["descripcion", "No anda"], ["responsable", "Pepito"], ["tipo", "Soporte"], ["prioridad", 3], ["updated_at", "2015-01-15 18:24:58.253566"], ["id", 83]]

  def destroy
    @incidente = Incidente.find(params[:id])
    @incidente.destroy
---
SELECT  "incidentes".* FROM "incidentes" WHERE "incidentes"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "incidentes" WHERE "incidentes"."id" = ?  [["id", 6]]

    def set_incidente
      @incidente = Incidente.find(params[:id])
---
SELECT  "incidentes".* FROM "incidentes" WHERE "incidentes"."id" = ? LIMIT 1  [["id", 5]]